# GetFabricRoundingManager Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ReinforcementSettings..::..GetFabricRoundingManager Method
ReinforcementSettings Class See Also
---
Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FabricRoundingManager GetFabricRoundingManager()
```

Visual Basic
---
```text
Public Function GetFabricRoundingManager As FabricRoundingManager
```

Visual C++
---
```text
public:
FabricRoundingManager^ GetFabricRoundingManager()
```

# ### Return Value
The rounding manager.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace